// /components/Guitar/chords.js
export const chords = {
    C: [0, 1, 0, 2, 3, 0],        // C和弦
    G: [3, 0, 0, 0, 2, 3],        // G和弦
    D: [2, 3, 2, 0, 0, -1],       // D和弦
    A: [0, 2, 2, 2, 0, -1],       // A和弦
    E: [0, 0, 1, 2, 2, 0],        // E和弦
    Am: [0, 1, 2, 2, 0, -1],      // Am和弦
    Em: [0, 0, 0, 2, 2, 0],       // Em和弦
    Dm: [1, 3, 2, 0, 0, -1],      // Dm和弦
    A7: [0, 2, 0, 2, 0, -1],      // A7和弦
    E7: [0, 0, 1, 0, 2, 0],       // E7和弦
    D7: [2, 1, 2, 0, 0, -1],      // D7和弦
    G7: [1, 0, 0, 0, 2, 3],       // G7和弦
    C7: [3, 1, 3, 2, 3, 0],       // C7和弦
    B7: [2, 0, 1, 2, 2, -1],      // B7和弦
    F: [1, 1, 2, 3, 3, 1],        // F和弦（常見的Barre和弦，適合初學者練習）
  };
  